import styled from 'styled-components'
import Header from '../components/common/Header'
import { colors } from '../styles/colors'

const Term = () => {
  return (
    <Container>
      <Header text="이용약관" backColor={colors.grey7} />
      <ContentWrapper>
        <ContentHeader>서비스 이용약관 (상품, 서비스 등 이용 일반 회원용)</ContentHeader>
        <ContentBody>
          본 이용약관(“본 약관”)은 귀하가 당사의 각종 웹 사이트, SMS, API, 이메일 알림, 애플리케이션, 버튼, 위젯, 광고,
          상거래 서비스를 포함한 당사의 서비스(이하 “플랫폼”라 총칭)와 플랫폼에 업로드 또는 다운로드 되거나 표시되는
          모든 정보, 텍스트, 링크, 그래픽, 사진, 음성, 동영상 또는 기타 자료나 자료의 배열(이하 “컨텐츠” 라 총칭)에
          접근하여 이를 이용하는 행위를 규율합니다. 귀하는 본 서비스를 이용함으로써 본 약관의 적용을 받는 것에
          동의합니다.
          <br />
          1. 서비스 이용 주체
          <br />
          귀하는 플랫폼과 구속력 있는 계약을 체결하는 데 동의하고 해당 관할권의 법률에 의거 서비스 이용이 금지된 자가
          아닐 경우에만 본 서비스를 이용할 수 있습니다. 귀하가 회사, 단체, 정부 또는 그 외 법인을 대신하여 본 약관에
          동의하고 본 서비스를 이용하는 경우, 귀하는 귀하에게 그에 대한 권한이 있으며 해당 권리주체를 본 약관에 구속시킬
          권한이 있음을 진술 및 보증합니다. 이 경우 본 약관에서 사용되는 “귀하” 및 “귀하의”라는 용어는 해당 권리주체를
          의미합니다.
          <br />
          2. 개인정보
          <br />
          당사의 개인정보 처리방침은 귀하가 플랫폼 이용 시 제공하는 정보를 당사가 취급하는 방식을 기술합니다. 귀하는
          플랫폼을 이용함으로써 귀하의 정보를 저장, 처리 및 이용할 목적으로 미국 또는 그 밖의 국가로 이전하는 등
          (개인정보 처리방침에 규정된 바와 같이) 수집 및 이용하는 것에 대해 동의하는 것임을 이해합니다.
          <br />
          3. 서비스의 콘텐츠
          <br />
          당사가 관련 법령에 따라 법률상 책임을 지는 경우를 제외하면, 귀하는 플랫폼 이용과 귀하가 제공하는 컨텐츠(귀하의
          컨텐츠가 관련 법률, 규정, 규칙을 준수하는지 여부 포함)에 대하여 책임이 있습니다. 귀하는 불법적이지 않은
          합법적인 규정 내 타인과 편하게 공유할 수 있는 컨텐츠만을 제공하여야 합니다.
          <br />
          귀하는 플랫폼을 통해 게시되거나 귀하가 플랫폼을 통해 취득하는 모든 컨텐츠 또는 자료의 이용 또는 신뢰에 대한
          위험을 스스로 부담합니다. 당사는 플랫폼을 통해 게시되는 컨텐츠나 전달 사항의 완전성, 진실성, 정확성 또는
          신뢰성을 지지, 지원, 대변 또는 보증하거나 플랫폼을 통해 표출된 어떠한 의견도 지지하지 않습니다. 귀하는
          플랫폼을 이용함으로써 불쾌하거나 유해하거나 부정확하거나 어떤 식으로든 부적절하다고 판단될 만한 컨텐츠에
          노출될 수 있으며, 경우에 따라서는 허위 내용으로 등록되었거나 기만적인 게시물에 노출될 수도 있음을 이해합니다.
          모든 컨텐츠에 대한 책임은 해당 컨텐츠를 스스로 게시한 사용자가 전적으로 부담합니다. 당사는 플랫폼을 통해
          게시되는 컨텐츠를 감시하거나 통제하지 못 할 수 있으며, 그러한 컨텐츠에 대해 당사는 어떤한 책임도 부담하지
          않습니다. 당사는 가령 저작권, 상표권 또는 기타 지식재산권 침해 혐의가 있거나 사칭, 위법한 행위 또는 가학적
          내용 등의 컨텐츠를 삭제할 수 있는 권리가 있습니다. 이러한 사항에 대해 신고 절차나 구체적인 방침은
          당사의 고객센터 또는 플랫폼 내 신고하기 메뉴를 참고하시기 바랍니다. 귀하의 콘텐츠에 대한 권리 또는 권리 부여
          귀하가 플랫폼에서 혹은 플랫폼을 통해 컨텐츠를 제출, 게시 또는 게재할 경우, 귀하는 현재 알려지거나 추후 개발될
          모든 미디어 또는 배포 방식을 통해 해당 컨텐츠를 전 세계에서 이용, 복사, 복제, 처리, 각색, 변경, 공개, 전송,
          게재 또는 배포할 수 있는 비독점적이며 무상의 라이센스(2차 라이센스를 허락할 수 있는 권리 포함)를 당사에
          허락합니다. 본 라이센스는 귀하가 당사에게 귀하의 컨텐츠를 전 세계인들에게 제공하고 타인들이 전 세계인들에게
          귀하의 컨텐츠를 제공할 수 있도록 하게 하는 권리를 부여합니다. 귀하는 본 라이센스가 컨텐츠 이용에 관한 당사의
          약관에 따라 플랫폼을 제공, 홍보 및 개선할 수 있는 권리를 포함할 뿐만 아니라, 플랫폼에 제출되었거나 본 서비스를
          통해 제출된 컨텐츠를 기타 미디어 및 서비스상에서 공급, 방송, 배포, 공유, 홍보 또는 게시하기 위한 목적으로
          여타의 회사, 단체 또는 개인에게 제공할 수 있는 당사의 권리도 포함한다는 사실에 동의합니다. 당사 또는 여타의
          회사, 단체 또는 개인은 귀하에 대한 대가의 지급 없이 귀하가 플랫폼을 통해 제출, 게시, 전송 또는 제공하는
          컨텐츠를 위와 같이 추가로 사용할 수 있습니다. 이는 귀하가 플랫폼을 이용하였다는 사실 자체가 바로 귀하의 컨텐츠
          및 그에따른 부속한 권리에 대한 적절한 보상으로 간주되기 때문입니다. 귀하는 플랫폼을 통해 귀하가 제출, 게시
          또는 게재하는 여하한 컨텐츠에 대하여 본 약관에 따른 모든 권리를 부여하기 위해 필요한 모든 권리, 라이센스,
          동의, 허가, 권능 및 자격이 있거나 이를 취득하였음을 진술·보장합니다. 귀하는 그러한 컨텐츠가 저작권이나 기타
          재산권에 해당하는 자료를 포함하지 않는 사실에 동의합니다. 단, 귀하가 법적인 권리를 보유한 경우는 제외됩니다.
          <br />
          4. 서비스 이용
          <br />
          귀하는 본 약관 및 관련 법률, 규칙 및 규정을 준수하는 경우에 한하여 플랫폼을 이용할 수 있습니다. 플랫폼은
          끊임없이 진화하고 있으며, 따라서 당사의 재량에 따라 수시로 변경될 수 있습니다. 귀하 또는 사용자들을 대상으로
          플랫폼(또는 서비스에 포함된 모든 기능)의 제공을 (영구적 또는 일시적으로) 중단할 수 있습니다. 또한 당사는
          당사의 재량에 따라 언제든지 이용 및 저장에 대한 상한을 설정할 권리가 있습니다. 당사는 또한 귀하에 대한 책임
          없이 플랫폼에서 컨텐츠를 삭제하거나 배포를 거부하고, 컨텐츠의 배포나 게시를 제한할 수 있으며, 사용자의 이용을
          중단 또는 해지하며, 아이디 및 사용자명을 반환받을 수 있습니다. 귀하의 본 서비스에 대한 접근 및 이용을 허락하는
          데 대한 대가로, 귀하는 플랫폼의 제 3 자 서비스 제공자와 파트너들이 플랫폼 상에 광고를 게재하거나, 귀하 또는
          다른 사용자들이 제출한 서비스상 컨텐츠 또는 정보의 게시와 관련하여 광고를 게재할 수 있다는 점에 동의합니다.
          또한 귀하는 당사가 제공하는 인터페이스 및 지침 이외의 방법을 사용하여 플랫폼에서 제공하는 서비스를 방해하거나
          비정상적인 방법으로 접근하는 등 오용하지 않는다는 점에 동의합니다. 관련 법률이 명시적으로 허용하는 경우만을
          제외하고, 귀하는 플랫폼의 일부로 귀하에게 제공된 소프트웨어의 기술적 제한 사항을 우회하지 않고, 해당
          소프트웨어를 리버스 엔지니어링하거나 역파일하거나 분해하지 않는다는 점에 동의합니다. 귀하는 플랫폼에
          접근하거나 플랫폼을 이용하는 동안 다음에 해당하는 행위를 할 수 없습니다. (i) 본 서비스의 비공개 영역, 플랫폼의
          컴퓨터 시스템 또는 플랫폼 제공자들의 기술적 전송 시스템에 접근하거나 이를 무단으로 변경하거나 혹은 이용하는
          행위, (ii) 어떤 시스템이나 네트워크의 취약점을 검사, 조사 또는 테스트하거나 보안 조치 내지 인증 조치를
          위반하거나 우회하는 행위, (iii) 귀하가 본 플랫폼과 체결한 별도의 계약에 따라 특별히 허용된 경우가 아닌 한,
          플랫폼이 제공한 것으로서 현재 이용 가능한 정식 인터페이스 이외의 모든 수단으로 본 서비스에 접근하거나 본
          서비스를 검색하는 행위 또는 그러한 접근이나 검색을 시도하는 행위(해설: 당사의 사전 동의 없이
          스크래핑(scraping)하는 행위는 명시적으로 금지됨), (iv) 이메일이나 게시물에서 TCP/IP 패킷 헤더나 헤더 정보의
          일부를 위조하는 행위 혹은 변경되었거나 기만적이거나 허위에 해당하는 소스 식별 정보를 전송할 목적으로 플랫폼을
          어떤 식으로든 이용하는 행위 또는 (v) 바이러스를 전송하는 행위, 플랫폼에서 오버로딩(overloading),
          플러딩(flooding) 또는 스패밍(spamming)을 실행하거나 폭탄 메세지(mail-message)을 전송하는 행위 등을 포함하여
          사용자, 호스트 또는 네트워크의 접근을 방해하거나 중단시키는 행위 혹은 그러한 방해나 중단을 시도하는 행위 또는
          본 서비스를 방해하거나 플랫폼에 심한 과부하를 일으키는 식으로 콘텐츠의 생성을 스크립팅(scripting)하는 행위.
          당사는 (i) 관련 법률, 규정, 법적 절차 또는 정부 요구를 이행하거나, (ii) 본 약관을 집행(본 약관의 위반 혐의에
          대한 조사 포함)하거나, (iii) 사기, 보안 또는 기술 사안을 발견, 예방 또는 달리 해결하거나, (iv) 사용자 지원
          요청에 대응하거나, (v) 사용자 및 대중의 권리, 재산 또는 안전을 보호하기 위하여 필요하다고 합리적으로 판단되는
          모든 정보를 접근, 열람, 보존 및 공개할 수 있는 권리를 보유합니다. 당사는 당사의 개인정보 처리방침에 따르는
          경우를 제외하고 제 3 자에게 개인식별정보를 공개하지 않습니다. 당사는 특정 서비스나 기능을 제공할 수 있으며,
          귀하의 해당 서비스나 기능의 사용과 관련하여 추가적인 이용약관이 적용될 수 있습니다. 이러한 추가적인 서비스를
          사용하거나 이에 대한 비용을 지불함으로써 귀하는 해당 서비스에 적용되는 여하한의 추가적인 이용약관에 동의하고
          그러한 추가적인 이용약관은 당사와 귀하 간 계약의 일부가 됩니다. 위와 같이 적용되는 추가적인 이용약관이 본
          약관과 충돌하는 경우, 추가적인 이용약관이 적용되는 해당 서비스를 귀하가 사용하는 동안에는 추가적인 이용약관이
          우선합니다. 귀하가 플랫폼 또는 서비스상 컨텐츠를 복제, 수정, 파생물 생성, 배포, 판매, 이전, 공개적으로 게시,
          공개적으로 수행, 전송하거나 달리 이용하고자 하는 경우, 귀하는 서비스 이용약관 또는 개인정보처리방 침 등의
          당사의 지침을 활용하여야 합니다. 귀하의 계정 귀하는플랫폼의 일부 또는 전체 기능 및 서비스를 이용하기 위해서는
          계정을 생성해야 할 수 있습니다. 귀하는 귀하의 계정을 보호할 책임이 있습니다. 따라서 강력한 비밀번호를 사용하고
          제3자에게 계정 정보를 공유하지 않는 등 계정 보호를 위해 노력해주시기 바랍니다. 귀하가 위의 조항을 준수하지
          않음으로 인해 발생하는 손실이나 손해에 대해서는 당사는 어떠한 경우에도 책임을 지지 않습니다. 귀하는 플랫폼에서
          제공하는 대부분의 전달 사항을 통제할 수 있습니다. 당사는 서비스 관련 공지사항 및 행정적 사안에 관한 메시지 등
          일부 전달 사항을 제공해야 할 수도 있습니다. 이러한 전달 사항은 플랫폼 내 필수 서비스로 간주되면, 귀하는 이를
          수신 거부할 수 없습니다. 귀하는 반드시 이메일 주소 항목의 계정 정보를 업데이트하여 당사가 비밀번호 변경 및
          공지사항 등 서비스와 관련된 전달사항을 다른 이에게 전달하지 않도록 정확하고 최신의 정보를 제공하도록 합니다.
          본 약관의 해지 귀하는 귀하의 계정을 비활성화하고 하고 플랫폼 이용을 중단함으로써 당사와 체결한 법적 계약을
          언제든지 해지할 수 있습니다. 귀하의 정보에 관한 자세한 내용은 개인정보 처리방침을 참고하시기 바랍니다. 당사의
          합리적인 소견으로 볼 때 (i) 귀하가 본 약관을 위반한 것으로 판단될 경우, (ii) 귀하가 당사에 대하여 위험을
          초래하거나 법적 문제를 야기한다고 판단될 경우, (iii) 불법행위로 인해 귀하의 계정을 삭제해야 한다고 판단될
          경우, (iv) 장기적인 비활동으로 인해 귀하의 계정을 삭제해야 한다고 판단될 경우, 또는 (v) 당사가 귀하에게 플랫폼
          및 서비스를 제공하는 것이 더 이상 상업적으로 가능하지 않다고 판단될 경우 등을 포함하나 이에 한정되지 않는
          경우, 당사는 이유를 불문하고 언제든지 귀하의 계정을 중단 또는 해지하거나 귀하에 대한 플랫폼 및 서비스(전부
          또는 일부)의 제공을 중단할 수 있습니다. 당사는 귀하의 계정과 연결된 이메일 주소를 통해 귀하에게 관련 사실을
          고지하기 위해 합리적인 노력을 기울일 것이며, 귀하가 향후 본인의 계정에 대한 접근을 시도할 때에도 그렇게 할
          것입니다. 위 조항들은 귀하의 계정이 비활성화되거나 해지되는 경우에도 불구하고 여전히 적용될 수 있습니다.
          <br />
          5. 책임의 부인 및 제한
          <br />
          “있는 그대로” 제공되는 서비스 귀하가 당사의 플랫폼 및 서비스를 통해 컨텐츠 접근하거나 이를 이용할 경우 그
          책임은 귀하에게 있습니다. 귀하는 본 서비스가 귀하에게 “있는 그대로” 그리고 “가용한 범위 내에서” 제공된다는
          사실을 이해하고 이에 동의합니다. “당사자”란 플리빗 및 관련된 모회사, 자회사, 계열사, 관계회사, 임원, 이사,
          직원, 대리인, 대표, 파트너 및 라이센서를 지칭합니다. 전술한 요건을 제한함이 없이, 관련 법령상 최대한 허용되는
          범위 내에서 당사자들은 상품성, 특정 목적에 대한 적합성 또는 비침해성에 관해 명시적이거나 묵시적인 어떠한 보증
          및 조건도 부인합니다. 당사자들은 다음과 같은 사항 즉, (i) 본 서비스나 어떤 컨텐츠의 완전성, 정확성, 가용성,
          적시성, 보안성 또는 신뢰성, (ii) 귀하가 플랫폼 또는 어떤 콘텐츠에 접근하거나 이를 이용한 이유로 귀하의 컴퓨터
          시스템에서 발생하는 손상, 데이터 손실 또는 그 밖의 피해, (iii) 본 서비스에 의해 유지되는 모든 콘텐츠 및 그 외
          전달 사항의 삭제, 저장 실패 또는 전송 실패 그리고 (iv) 본 서비스가 귀하의 요구 사항을 충족한다거나 본 서비스가
          끊김 없이 안전하게 또는 오류 없이 제공되는지 여부 등에 관하여 어떠한 보증 또는 진술도 하지 않으며 이에 대한
          모든 책임 및 의무를 부인합니다. 당사자들로부터 또는 본 서비스를 통해 입수한 구두 또는 서면상의 어떠한 권고
          사항 또는 정보도 본 약관에서 명시되지 않은 보증 또는 진술을 제공하지 않습니다. 책임의 제한 당사자들은 (i)
          귀하가 본 서비스에 접근하는 행위나 본 서비스를 이용하는 행위 또는 본 서비스에 대한 접근 불능 내지 이용 불능,
          (ii) 본 서비스상에서 특정 제 3 자의 행위나 콘텐츠(다른 사용자나 제 3 자가 범한 명예훼손적, 모욕적, 불법적인
          행위를 포함하나 이에 한정되지 않음), (iii) 본 서비스로부터 획득한 모든 콘텐츠 또는 (iv) 귀하의 전송 내역이나
          콘텐츠에 무단으로 접근하거나 이러한 정보를 무단으로 이용 또는 변경하는 행위 등의 제반 사유로 인해 발생하는
          간접 손해, 부수적 손해, 특별 손해, 결과적 손해나 징벌적 손해, 수익 손실 또는 매출 손실(직접 또는 간접적으로
          발생했는지 여부에 관계없음) 혹은 데이터, 이용 권한 또는 영업권의 상실 내지는 기타 무형 손실에 대해 어떠한
          책임도 지지 않습니다. 본 호에 규정된 제한 사항은 보증, 계약, 법령, 불법 행위(과실 포함) 등을 근거로 하는지
          여부 및 당사자들이 해당 손해가 발생할 가능성을 고지받았는지 여부에 관계없이, 그리고 본 약관에 명시된 구제
          수단이 당해 구제 수단의 주요 목적을 달성하지 못한 것으로 확인될 경우에도 모든 근거의 책임에 적용됩니다. 일부
          관할권에서는 암묵적 보증의 제외 또는 암묵적 보증의 적용 제한을 허용하지 않으므로, 위 보증의 부인은 귀하에게
          전적으로 적용되지 않을 수 있으나, 관련 법률에 따라 허용되는 최대한의 한도로 적용됩니다.
          <br />
          6. 마케팅 정보 활용 동의
          <br />본 마케팅 정보 수신에 대한 동의를 거부하실 수 있으며, 이 경우 회원가입은 가능하나 일부 서비스 이용 및
          각종 광고, 서비스, 이벤트 및 이용자 맞춤형 서비스 추천 등 기타 서비스 제공이 제한될 수 있습니다. 본인은 아래와
          같이 마케팅 정보 수신에 동의합니다. 개인정보 수집 항목 : 가입 시 등록하는 회원정보에 한함
          <br />
          개인정보 수집 이용 목적 : 마케팅 및 광고의 활용 및 신규 서비스(제품) 개발 및 맞춤 서비스 제공, 이벤트 및
          광고성 정보 제공 및 참여기회 제공, 인구통계학적 특성에 따른 서비스 제공 및 광고 게재, 서비스의 유효성 확인,
          접속빈도 파악 또는 회원의 서비스 이용에 대한 통계 등을 목적으로 개인정보를 처리
          <br />
          보유 및 이용기간 : 이용자가 동의를 철회하거나 탈퇴시까지 보유 및 이용
          <br />
          서비스를 운용함에 있어 각종 정보를 서비스 화면, 이메일주소, 앱푸시 등 다양한 방법으로 회원에게 제공할 수
          있으며, 의무적으로 안내되어야 하는 정보성 내용은 수신동의 여부와 무관하게 제공됩니다. 상기 내용이 변동되는
          경우 서비스 화면 및 이메일 등을 통해 그 내용을 안내 합니다.
          <br />
          7. 일반 규정
          <br />
          당사는 본 약관을 수시로 개정할 수 있습니다. 수정사항은 소급적용되지 않으며, 본 약관의 최신버전이 당사와 귀하
          간의 관계를 규율합니다. 당사는 귀하에게 서비스 내 공지하거나 귀하의 계정과 연결된 이메일로 이메일을 발송하는
          등 주요 개정사항에 대해 고지할 것입니다. 귀하는 개정사항이 발효한 이후 본 서비스를 계속해서 접근 및
          이용함으로써 개정된 본 약관의 적용을 받는 것에 동의합니다. 본 약관의 어느 조항이 무효이거나 집행불능인 것으로
          결정되는 경우, 해당 조항은 필요 최소한의 수준으로 제한 또는 삭제되며, 본 약관의 나머지 조항은 계속해서 완전한
          효력이 유지됩니다. 본 약관에 따른 권리 또는 조항을 집행하지 않는다고 하여 해당 권리 또는 조항을 포기하는
          것으로 간주되지 않습니다. 본 약관에 관한 질문이 있으신 경우 고객센터로 문의하시길 바랍니다. <br />
          공고일자: 2024년 5월 5일
          <br />
        </ContentBody>
      </ContentWrapper>
    </Container>
  )
}

export default Term

const Container = styled.div`
  width: 100%;
  height: 100%;
  position: relative;
  display: flex;
  flex-direction: column;
  align-items: center;
`

const ContentWrapper = styled.div`
  display: flex;
  padding: 20px;
  flex-direction: column;
  align-items: flex-start;
  gap: 30px;
  align-self: stretch;
  border-radius: 12px;
  background: ${colors.white};
  margin: 20px;
`

const ContentHeader = styled.div`
  align-self: stretch;
  color: ${colors.grey1};
  font-family: Pretendard;
  font-size: 14px;
  font-style: normal;
  font-weight: 600;
  line-height: 150%;
  letter-spacing: -0.56px;
`

const ContentBody = styled(ContentHeader)`
  font-family: Abel;
  font-weight: 400;
`
